Repository: userpeaseonly/basirat-course
Catalog: locale/*/LC_MESSAGES/django.po
Languages: uz

source: All rights reserved.
uz: Barcha huquqlar himoyalangan.

source: Student
uz: Talaba

source: Logout
uz: Chiqish

source: Login
uz: Kirish

source: Enter your phone number (e.g. +998901234567)
uz: Telefon raqamingizni kiriting (masalan: +998901234567)

source: Sign in
uz: Kirish

source: Home - Basirat
uz: Bosh sahifa - Basirat

source: Welcome, %(username)s!
uz: Xush kelibsiz, %(username)s!

source: You are logged in as a student.
uz: Siz talaba sifatida tizimga kirdingiz.

source: You are logged in as an administrator.
uz: Siz administrator sifatida tizimga kirdingiz.

source: User Details
uz: Foydalanuvchi ma'lumotlari

source: Phone number:
uz: Telefon raqami:

source: Status:
uz: Holat:

source: Name:
uz: Ism:

source: Surname:
uz: Familiya:

source: Registered on:
uz: Ro'yxatdan o'tgan sana:

source: Quick Links
uz: Tezkor havolalar

source: Admin Panel
uz: Admin Paneli

source: System Settings
uz: Tizim sozlamalari

source: API Docs
uz: API hujjatlari

source: Swagger API documentation
uz: Swagger API hujjatlari

source: Sign out
uz: Chiqish

source: Phone number
uz: Telefon raqami

source: Password
uz: Parol

source: You do not have permission to access this page. Only students may enter.
uz: Siz ushbu sahifaga kirish huquqiga ega emassiz. Faqat talabalar kirishi mumkin.

source: You do not have permission to access this page. Only administrators may enter.
uz: Siz ushbu sahifaga kirish huquqiga ega emassiz. Faqat administratorlar kirishi mumkin.

source: Students and administrators
uz: Talabalar va administratorlar

source: Home
uz: Bosh sahifa

source: Courses
uz: Kurslar

source: Create account
uz: Hisob ochish

source: Logged in
uz: Tizimga kirdingiz

source: Explore available and upcoming learning paths created by the Basirat team.
uz: Basirat jamoasi tomonidan yaratilgan mavjud va rejalashtirilgan o'quv yo'nalishlarini o'rganing.

source: Course
uz: Kurs

source: View course
uz: Kursni ko'rish

source: Lessons
uz: Darslar

source: No summary yet.
uz: Hozircha umumiy ma'lumot yo'q.

source: Course catalogue is empty at the moment. Please check back later.
uz: Hozircha kurs katalogi bo'sh. Iltimos, keyinroq qaytib keling.

source: Enrolled
uz: Ro'yxatdan o'tgan

source: Enrollment pending
uz: Ro'yxatdan o'tish kutilyapti

source: Enrollment rejected
uz: Ro'yxatdan o'tish rad etildi

source: Request enrollment
uz: Ro'yxatdan o'tishni so'rang

source: Lesson
uz: Dars

source: Available
uz: Mavjud

source: Locked
uz: Yopiq

source: Open lesson
uz: Darsni ochish

source: Lessons are coming soon.
uz: Darslar tez orada paydo bo'ladi.

source: Details coming soon.
uz: Ma'lumotlar tez orada paydo bo'ladi.

source: Back to course
uz: Kursga qaytish

source: Learning resource
uz: O'quv materiali

source: Task
uz: Vazifa

source: Completed
uz: Bajarildi

source: Open resource
uz: Manbani ochish

source: Downloads and copy-pastes are disabled for protected materials.
uz: Himoyalangan materiallar uchun yuklab olish va nusxa olish cheklanadi.

source: Mark as completed
uz: Bajarilgan deb belgilash

source: No materials have been added yet.
uz: Hali materiallar qo'shilmagan.

source: Task questions must not include uploaded learning files.
uz: Vazifa savollari yuklangan o'quv fayllarini o'z ichiga olmaydi.

source: Task materials require a question type.
uz: Vazifa materiallari uchun savol turi kerak.

source: Task materials require a payload describing the question.
uz: Vazifa materiallari savolni tavsiflovchi ma'lumotni talab qiladi.

source: Learning materials should not define question metadata.
uz: O'quv materiallari savol metama'lumotlarini belgilamasligi kerak.

source: Learning materials must include text or an uploaded asset.
uz: O'quv materiallarida matn yoki yuklangan fayl bo'lishi shart.

source: Your browser does not support inline video playback.
uz: Brauzeringiz ichki video ijrosini qo'llab-quvvatlamaydi.
